# Memory dumping with Werfault.exe
## Credential Access
## T1003.001

### MDE

`DeviceFileEvents
| where InitiatingProcessParentFileName has "werfault.exe" or InitiatingProcessFileName has "werfault.exe"
| where FolderPath contains "lsass"
| project Timestamp, DeviceName, ActionType, FolderPath, FileName, PreviousFolderPath, PreviousFileName, FileSize, SHA256, InitiatingProcessFolderPath, InitiatingProcessFileName, InitiatingProcessCommandLine, InitiatingProcessId, InitiatingProcessSHA256, InitiatingProcessParentFileName, InitiatingProcessParentId, InitiatingProcessAccountDomain, InitiatingProcessAccountName, InitiatingProcessVersionInfoCompanyName, InitiatingProcessVersionInfoProductName, InitiatingProcessVersionInfoProductVersion, InitiatingProcessVersionInfoInternalFileName, InitiatingProcessVersionInfoOriginalFileName, InitiatingProcessVersionInfoFileDescription, DeviceId, ReportId
| order by Timestamp`

### Sentinel

`SecurityEvent
| where NewProcessName endswith "werfault.exe"
| where ObjectName endswith "lsass.exe"
| project NewProcessName, ObjectName`
