# T1087.001: Account Discovery - Local Account Enumeration

## Query Information

#### MITRE ATT&CK Technique(s)

| Technique ID | Title    | Link    |
| ---  | --- | --- |
| T1087.001 | Account Discovery: Local Account | [Local Account](https://attack.mitre.org/techniques/T1087/001/) |

#### Description
Detects local account discovery via mmc.exe spawning lusrmgr.msc (Local Users and Groups snap-in). This behavior indicates an adversary is enumerating local accounts on a compromised system.

#### Risk
Local account discovery is a common post-exploitation activity used to identify accounts for lateral movement or privilege escalation.

#### Author <Optional>
- **Name:** Gavin Knapp
- **Github:** https://github.com/m4nbat 
- **Twitter:** https://twitter.com/knappresearchlb
- **LinkedIn:** https://www.linkedin.com/in/grjk83/
- **Website:**

#### References
- https://attack.mitre.org/techniques/T1087/001/

## Defender For Endpoint
```KQL
DeviceProcessEvents
| where initiatingProcessFileName =~"mmc.exe" and FileName =~ "lusrmgr.msc"
//Telemetry showed execution of mmc.exe, the Microsoft Management Console, spawning the lusrmgr.msc (Local Users and Groups snap-in) which displays local account information.
```

## Sentinel
```KQL
DeviceProcessEvents
| where initiatingProcessFileName =~"mmc.exe" and FileName =~ "lusrmgr.msc"
//Telemetry showed execution of mmc.exe, the Microsoft Management Console, spawning the lusrmgr.msc (Local Users and Groups snap-in) which displays local account information.
```
