# T1087.001: Account Discovery - Local Account

# Sources:


## Execution of mmc.exe, the Microsoft Management Console, spawning the lusrmgr.msc (Local Users and Groups snap-in) which displays local account information.


```
DeviceProcessEvents
| where initiatingProcessFileName =~"mmc.exe" and FileName =~ "lusrmgr.msc"
//Telemetry showed execution of mmc.exe, the Microsoft Management Console, spawning the lusrmgr.msc (Local Users and Groups snap-in) which displays local account information.
```
